---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MassLevelData.NExteriorSurfaceArea
source: html/f8179e61-5d07-3a53-5146-0e679710311f.htm
---
# Autodesk.Revit.DB.Analysis.MassLevelData.NExteriorSurfaceArea Property

The exterior surface area of the volume of the mass between the level of this MassLevelData (Mass Floor) to the next in the mass.

## Syntax (C#)
```csharp
public double NExteriorSurfaceArea { get; }
```